test_envs/perftest/tyokoneseuranta_api.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.8" jmeter="2.13 r1665067">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">OAM_REMOTE_USER</stringProp>
            <stringProp name="Header.value">fastroi</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1442914723000</longProp>
        <longProp name="ThreadGroup.end_time">1442914723000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Työkoneseuranta API" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;otsikko&quot;: {&#xd;
    &quot;lahettaja&quot;: {&#xd;
      &quot;jarjestelma&quot;: &quot;Urakoitsijan järjestelmä&quot;,&#xd;
      &quot;organisaatio&quot;: {&#xd;
        &quot;nimi&quot;: &quot;Destia Oy&quot;,&#xd;
        &quot;ytunnus&quot;: &quot;2163026-3&quot;&#xd;
      }&#xd;
    },&#xd;
    &quot;viestintunniste&quot;: {&#xd;
      &quot;id&quot;: 123&#xd;
    },&#xd;
    &quot;lahetysaika&quot;: &quot;2016-01-30T12:00:00Z&quot;&#xd;
  },&#xd;
  &quot;havainnot&quot;: [&#xd;
    {&#xd;
      &quot;havainto&quot;: {&#xd;
        &quot;tyokone&quot;: {&#xd;
          &quot;id&quot;: 31337,&#xd;
          &quot;tyokonetyyppi&quot;: &quot;aura-auto&quot;&#xd;
        },&#xd;
        &quot;sijainti&quot;: {&#xd;
          &quot;koordinaatit&quot;: {&#xd;
            &quot;x&quot;: 7198151,&#xd;
            &quot;y&quot;: 429005&#xd;
          }&#xd;
        },&#xd;
        &quot;suunta&quot;: 46,&#xd;
        &quot;havaintoaika&quot;: &quot;2016-01-30T12:00:00Z&quot;,&#xd;
        &quot;urakkaid&quot;: 4,&#xd;
        &quot;sopimusid&quot;: 7,&#xd;
        &quot;suoritettavatTehtavat&quot;: [&#xd;
          &quot;pistehiekoitus&quot;,&#xd;
          &quot;suolaus&quot;&#xd;
        ]&#xd;
      }&#xd;
    }&#xd;
  ]&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">harja-test.solitaservices.fi</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.path">/api/seuranta/tyokone</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
          <stringProp name="TestPlan.comments">Kutsuu työkoneenseuranta-apia</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="RespTimeGraph.interval">500</stringProp>
        </ResultCollector>
        <hashTree/>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">5000</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>